/*String19°.Дана строка.Если она представляет собой запись целого числа,
то вывести 1, если вещественного(с дробной частью) — вывести 2; если строку
нельзя преобразовать в число, то вывести 0. Считать, что дробная часть
вещественного числа отделяется от его целой части десятичной точкой «.».*/

#include <iostream>
#include <string>

using namespace std;

int main()
{
	string s;
	int counter = 0;
	cin >> s;
	for (int i = 0; i < s.size(); i++) 
	{
		if ((s[i] != '0' && s[i] != '1' && s[i] != '2' && s[i] != '3' && s[i] != '4' && s[i] != '5' && s[i] != '6' && s[i] != '7' && s[i] != '8' && s[i] != '9') && s[i] != '.')
		{
			counter += 0;
		}
		else
		{
			if ((s[i] == '0' && s[i] == '1' && s[i] == '2' && s[i] == '3' && s[i] == '4' && s[i] == '5' && s[i] == '6' && s[i] == '7' && s[i] == '8' && s[i] == '9') || s[i] == '.')
				{
					counter += 2;
				}
			else
			{
				counter += 1;
			}
		}
	}
	if (counter == s.length())
		cout << 1;
	else
	{
		if (counter == s.length() + 1)
			cout << 2;
		else
			cout << 0;
	}
}

/*
1234
1
*/


/*
123.43
2
*/

/*
123,32
0
*/

/*
13d4
0
*/

